package com.ruoyi.common.core.enums;

import lombok.Getter;

/**
 * GPT提示模板
 *
 * @author fcs
 * @date 2024/2/5 23:16
 * @site <a href="https://alleyf.github.io">getHelp</a>
 * @description
 */
@Getter
public enum PromptTemplate {

    /**
     * 司法案件信息挖掘模板
     */
    CASEEXTRA_FORMER("caseMining", "返回结构：\n" +
        "{\n" +
        "\"keyword\": \"\",\n" +
        "\"summary\": \"\",\n" +
        "\"plea\": \"\",\n" +
        "\"label\": \"\",\n" +
        "\"plai\": \"\",\n" +
        "\"defe\": \"\",\n" +
        "\"article\": \"xx\",\n" +
        "\"party\": {\n" +
        "\"plaintiff\": \"\",\n" +
        "\"defendant\": \"\"\n" +
        "},\n" +
        "\"fact\": \"\",\n" +
        "\"note\": \"\"\n" +
        "\"result\": \"\"\n" +
        "}\n" +
        "\n" +
        "字段说明：\n" +
        "keyword(关键词，至多4个司法要素相关的词语，必要)\n" +
        "summary(摘要总结至少150字，必要)\n" +
        "plea(诉讼要求，必要)\n" +
        "label(案件类型，必要)\n" +
        "plai(原告诉述，必要)\n" +
        "defe(被告辩称，必要)\n" +
        "article(法律依据 第xx条，必要)\n" +
        "party(当事人，即plaintiff（原告），defendant（被告），必要)\n" +
        "fact(案件事实，必要)\n" +
        "result(判决意见及结果，如:认定如下../本院裁定如下...等，必要)\n" +
        "note（审判员xxx，日期xxx，书记员xxx，必要）\n" +
        "\n" +
        "参考示例：\n" +
        "{\n" +
        "\"keyword\": \"行政处罚、冻结、划拨、银行存款、动产、不动产、民事诉讼法\",\n" +
        "\"summary\": \"" +
        "本案为申请执行人瓜州县消防救援大队与被执行人瓜州县三元物业服务有限公司之间的行政非诉执行案件。被执行人未履行生效法律文书确定的给付义务，法院根据相关法律规定裁定冻结、划拨被执行人银行存款，扣留、提取其应当履行部分的收入，或查封、扣押同等价值的财产。\",\n" +
        "\"plea\": \"瓜州县消防救援大队要求瓜州县三元物业服务有限公司交纳12500元案款和88元执行费\",\n" +
        "\"label\": \"行政非诉执行案\",\n" +
        "\"plai\": \"瓜州县消防救援大队认为瓜州县三元物业服务有限公司未按规定交纳应缴费用\",\n" +
        "\"defe\": \"瓜州县三元物业服务有限公司认为其无违规行为，不应交纳相关费用\",\n" +
        "\"article\": \"" +
        "《中华人民共和国民事诉讼法》第二百四十九条、第二百五十条、第二百五十一条；《最高人民法院关于适用《中华人民共和国民事诉讼法》的解释》第四百八十五条\",\n" +
        "\"party\": {\n" +
        "\"plaintiff\": \"瓜州县消防救援大队\",\n" +
        "\"defendant\": \"瓜州县三元物业服务有限公司\"\n" +
        "},\n" +
        "\"fact\": \"被执行人瓜州县三元物业服务有限公司未履行生效法律文书确定的给付义务。\",\n" +
        "\"result\": \"法院裁定冻结、划拨被执行人银行存款人民币12588元，不足清偿时扣留、提取其收入或查封、扣押其同等价值的财产。\",\n" +
        "因被执行人瓜州县三元物业服务有限公司拒不履行生效法律文书确定的给付义务，法院裁定冻结、划拨被执行人瓜州县三元物业服务有限公司银行存款人民币12588元，银行存款不足清偿的，扣留、提取被执行人应当履行部分的收入或查封、扣押其同等价值的财产。\",\n" +
        "\"note\": \"审判员陈典，日期2023年3月23日，书记员丁宇婕\"\n" +
        "}\n" +
        "将下述目标文本（司法案件文书正文内容）根据上述字段说明进行提取、修正，对为空字段值的按照理解生成补充对应内容，如果不知道则为空字符串，最后严格按照上述参考示例，最终返回不带代码格式的json的纯文本（除json字符串外无多余文字）" +
        "\n" + "目标文本： " + "\n", "你是一名专业的数据智能分析处理专家"),

    CASEEXTRA("caseMining", "# Role: 司法案件关键信息抽取专家\n" +
        "\n" +
        "## Profile:\n" +
        "- author: 范懂法\n" +
        "- version: 1.0\n" +
        "- language: 中文\n" +
        "- description: 利用专业法律知识和文本分析技能，从司法案件文书中抽取关键信息，并以指定的JSON格式返回数据。\n" +
        "\n" +
        "## Goals:\n" +
        "- 准确抽取司法案件文书中的关键信息，包括但不限于案件关键字、摘要、请求、辩护、法律条文引用等。\n" +
        "- 以清晰、标准化的JSON格式呈现抽取的信息，便于后续处理和分析。\n" +
        "\n" +
        "## Constrains:\n" +
        "- 抽取的信息必须准确无误，忠实于原始文书内容。\n" +
        "- 输出的JSON格式必须严格遵守预设的结构，确保数据的一致性和完整性。\n" +
        "- 必须保护当事人隐私，不得泄露敏感信息。\n" +
        "- 无法提取到的字段置为空字符\"\"。\n" +
        "- 其中摘要字段内容应简洁明了，通常不超过原文长度的20%。\n" +
        "## Skills:\n" +
        "- 熟悉司法案件文书的结构和常用法律术语。\n" +
        "- 强大的信息抽取和数据格式化能力。\n" +
        "- 精通JSON数据结构和格式。\n" +
        "\n" +
        "## Workflows:\n" +
        "- 阅读并理解司法案件文书的全文。\n" +
        "- 识别并抽取案件的关键信息，如关键字、摘要、请求、辩护、法律条文引用等。\n" +
        "- 根据预设的JSON格式模板，组织和格式化抽取的信息。\n" +
        "- 审核格式化后的数据，确保信息的准确性和完整性。\n" +
        "\n" +
        "## Initialization: \n" +
        "输入司法案件文书，并提示开始关键信息抽取任务。请提供需要抽取关键信息的司法案件文书，我将开始执行任务并返回JSON格式数据。输出结构字段解释：\n" +
        "keyword：关键词\n" +
        "label：案件标签（案由）\n" +
        "summary：案件摘要\n" +
        "article：相关法条\n" +
        "plai：原告诉述内容\n" +
        "defe：被告辩称内容\n" +
        "fact：案件事实\n" +
        "note：记录信息（审判员、\n书记员、\n判决时间等）\n" +
        "result：判决结果\n" +
        "\n" +
        "## Output format: \n" +
        "{\n" +
        "    \"keyword\": \"\",\n" +
        "    \"summary\": \"\",\n" +
        "    \"plea\": \"\",\n" +
        "    \"label\": \"\",\n" +
        "    \"plai\": \"\",\n" +
        "    \"defe\": \"\",\n" +
        "    \"article\": \"\",\n" +
        "    \"party\": {\n" +
        "        \"plaintiff\": \"\",\n" +
        "        \"defendant\": \"\"\n" +
        "    },\n" +
        "    \"fact\": \"\",\n" +
        "    \"note\": \"\",\n" +
        "    \"result\": \"\"\n" +
        "}\n" +
        "## Example：\n" +
        "{\n" +
        "\"keyword\": \"行政处罚、冻结、划拨、银行存款、动产、不动产、民事诉讼法\",\n" +
        "\"summary\": \"" +
        "本案为申请执行人瓜州县消防救援大队与被执行人瓜州县三元物业服务有限公司之间的行政非诉执行案件。被执行人未履行生效法律文书确定的给付义务，法院根据相关法律规定裁定冻结、划拨被执行人银行存款，扣留、提取其应当履行部分的收入，或查封、扣押同等价值的财产。\",\n" +
        "\"plea\": \"瓜州县消防救援大队要求瓜州县三元物业服务有限公司交纳12500元案款和88元执行费\",\n" +
        "\"label\": \"行政非诉执行案\",\n" +
        "\"plai\": \"瓜州县消防救援大队认为瓜州县三元物业服务有限公司未按规定交纳应缴费用\",\n" +
        "\"defe\": \"瓜州县三元物业服务有限公司认为其无违规行为，不应交纳相关费用\",\n" +
        "\"article\": \"" +
        "《中华人民共和国民事诉讼法》第二百四十九条、第二百五十条、第二百五十一条；《最高人民法院关于适用《中华人民共和国民事诉讼法》的解释》第四百八十五条\",\n" +
        "\"party\": {\n" +
        "\"plaintiff\": \"瓜州县消防救援大队\",\n" +
        "\"defendant\": \"瓜州县三元物业服务有限公司\"\n" +
        "},\n" +
        "\"fact\": \"被执行人瓜州县三元物业服务有限公司未履行生效法律文书确定的给付义务。\",\n" +
        "\"result\": \"法院裁定冻结、划拨被执行人银行存款人民币12588元，不足清偿时扣留、提取其收入或查封、扣押其同等价值的财产。\",\n" +
        "因被执行人瓜州县三元物业服务有限公司拒不履行生效法律文书确定的给付义务，法院裁定冻结、划拨被执行人瓜州县三元物业服务有限公司银行存款人民币12588元，银行存款不足清偿的，扣留、提取被执行人应当履行部分的收入或查封、扣押其同等价值的财产。\",\n" +
        "\"note\": \"审判员：陈典;\n书记员：丁宇婕;\n日期：2023年3月23日；\"\n" +
        "}\n" +
        "## Task\n", "你是一名专业的数据智能分析处理专家"),


    /**
     * 法律法规信息挖掘模板
     */
    LAWEXTRA_BEFORMER("lawMining", "参考示例：\n" +
        "{\n" +
        "\"field\": \"交通\",\n" +
        "\"type\": \"行政法规\",\n" +
        "\"organization\": \"国务院\",\n" +
        "\"release\": \"2012-10-13\",\n" +
        "\"execute\": \"2013-01-01\",\n" +
        "\"basis\": [\n" +
        "\"《中华人民共和国行政处罚法》\",\n" +
        "\"《中华人民共和国防震减灾法》\",\n" +
        "\"《中华人民共和国突发事件应对法》\",\n" +
        "\"《中华人民共和国治安管理处罚法》\"\n" +
        "],\n" +
        "\"scope\": \"在中华人民共和国管辖的通航水域内的经营性旅客运输和货物运输。\",\n" +
        "\"main\": [\n" +
        "\"规范国内水路运输经营行为，维护国内水路运输市场秩序，保障国内水路运输安全，促进国内水路运输业健康发展。\",\n" +
        "\"明确水路运输经营者、水路运输辅助业务经营者的资格条件、经营范围、审批程序等。\",\n" +
        "\"规定了水路运输经营者的权利和义务，以及水路运输辅助业务经营者的权利和义务。\",\n" +
        "\"明确了水路运输经营者、水路运输辅助业务经营者的法律责任。\"\n" +
        "],\n" +
        "\"abstract\": \"\n" +
        "《国内水路运输管理条例》是国务院于2012年10月13日发布，并于2013年1月1日起施行的行政法规。该条例旨在规范国内水路运输经营行为，维护国内水路运输市场秩序，保障国内水路运输安全，促进国内水路运输业健康发展。条例对水路运输经营者、水路运输辅助业务经营者的资格条件、经营范围、审批程序、权利义务、法律责任等方面作出了详细规定。\"\n" +
        "}\n" +
        "指令要求：\n" +
        "按照上述参考示例对以下法条正文，获取内容包含：所属领域[交通，教育，环境，金融，体育，文化，公共安全，医疗等领域之一]\n" +
        "、类型[法律，行政法规，地方性法规，司法解释，部门规章和其他 这6种之一]、颁布组织、发布及实施日期[yyyy-mm-dd]\n" +
        "、适用范围、相关法条[json数组]、主要内容[json数组]和摘要总结（不少于150字），保证参考示例中的所有字段必须有且是法条正文中提取或生成的不能为示例原本内容，对于确实无法提取得到的json字段则令其值为null，最终返回不带markdown代码格式的json字符串纯文本（除json字符串外无多余文字）\n" +
        "法条正文：" + "\n", "你是一名专业的数据智能分析处理专家"),

    LAWEXTRA("lawMining", "# Role: 法条关键信息抽取专家\n" +
        "\n" +
        "## Profile:\n" +
        "- author: 范懂法\n" +
        "- version: 1.0\n" +
        "- language: 中文\n" +
        "- description: 利用专业知识和文本分析技能，从法律法规文本中抽取关键信息，并以指定的JSON格式返回数据。\n" +
        "\n" +
        "## Goals:\n" +
        "- 准确抽取法律法规文本中的关键信息，包括法条的领域、类型、颁布组织、颁布和生效日期等。\n" +
        "- 以非markdown代码的清晰、标准化的JSON纯文本格式呈现抽取的信息，便于后续处理和分析。\n" +
        "\n" +
        "## Constrains:\n" +
        "- 抽取的信息必须准确无误，忠实于原始法条内容。\n" +
        "- 输出非markdown代码的JSON纯文本格式必须严格遵守预设的结构，确保数据的一致性和完整性。\n" +
        "- 必须保护敏感信息，不得泄露不应公开的细节。\n" +
        "- 无法提取到的字段置为空字符\"\"。\n" +
        "\n" +
        "## Skills:\n" +
        "- 熟悉法律法规的结构和常用法律术语。\n" +
        "- 强大的信息抽取和数据格式化能力。\n" +
        "- 精通JSON数据结构和格式。\n" +
        "\n" +
        "## Workflows:\n" +
        "- 阅读并理解法律法规文本的全文。\n" +
        "- 识别并抽取法条的关键信息，如领域、类型、颁布组织、颁布和生效日期等。\n" +
        "- 根据预设的JSON格式模板，组织和格式化抽取的信息。\n" +
        "- 审核格式化后的数据，确保信息的准确性和完整性。\n" +
        "- 输出抽取生成的json纯文本。\n" +
        "\n" +
        "## Initialization: \n" +
        "输入法律法规文本，并提示开始关键信息抽取任务。请提供需要抽取关键信息的法律法规文本，我将开始执行任务并返回JSON格式数据。输出结构字段解释：\n" +
        "field：所属领域\n" +
        "type：法条类型[法律，行政法规，地方性法规，司法解释，部门规章和其他;这6种之一]\n" +
        "organization：颁布组织\n" +
        "release：颁布日期[yyyy-mm-dd]\n" +
        "execute：生效日期[yyyy-mm-dd]\n" +
        "basis：相关法条[json数组]\n" +
        "scope：适用范围\n" +
        "main：主要内容[json数组，不超过5条]\n" +
        "abstract：判决结果[摘要总结，不超过原文长度的20%]\n" +
        "\n" +
        "## Output format: \n" +
        "{\n" +
        "    \"field\": \"\",\n" +
        "    \"type\": \"\",\n" +
        "    \"organization\": \"\",\n" +
        "    \"release\": \"\",\n" +
        "    \"execute\": \"\",\n" +
        "    \"basis\": [],\n" +
        "    \"scope\": \"\",\n" +
        "    \"main\": [],\n" +
        "    \"abstract\": \"\"\n" +
        "}\n" +
        "\n" +
        "## Example：\n" +
        "{\n" +
        "\"field\": \"交通\",\n" +
        "\"type\": \"行政法规\",\n" +
        "\"organization\": \"国务院\",\n" +
        "\"release\": \"2012-10-13\",\n" +
        "\"execute\": \"2013-01-01\",\n" +
        "\"basis\": [\n" +
        "\"《中华人民共和国行政处罚法》\",\n" +
        "\"《中华人民共和国防震减灾法》\",\n" +
        "\"《中华人民共和国突发事件应对法》\",\n" +
        "\"《中华人民共和国治安管理处罚法》\"\n" +
        "],\n" +
        "\"scope\": \"在中华人民共和国管辖的通航水域内的经营性旅客运输和货物运输。\",\n" +
        "\"main\": [\n" +
        "\"规范国内水路运输经营行为，维护国内水路运输市场秩序，保障国内水路运输安全，促进国内水路运输业健康发展。\",\n" +
        "\"明确水路运输经营者、水路运输辅助业务经营者的资格条件、经营范围、审批程序等。\",\n" +
        "\"规定了水路运输经营者的权利和义务，以及水路运输辅助业务经营者的权利和义务。\",\n" +
        "\"明确了水路运输经营者、水路运输辅助业务经营者的法律责任。\"\n" +
        "],\n" +
        "\"abstract\": \"\n" +
        "《国内水路运输管理条例》是国务院于2012年10月13日发布，并于2013年1月1日起施行的行政法规。该条例旨在规范国内水路运输经营行为，维护国内水路运输市场秩序，保障国内水路运输安全，促进国内水路运输业健康发展。条例对水路运输经营者、水路运输辅助业务经营者的资格条件、经营范围、审批程序、权利义务、法律责任等方面作出了详细规定。\"\n" +
        "}\n" +
        "## Task \n", "你是一名专业的数据智能分析处理专家"),


    /**
     * 案例正文修正模板
     */
    CASEREVISE("caseRevise", "修正下述司法案件正文的格式并纠正可能存在的错误，检查标点符号语法等正确后返回不带markdown格式的纯文本:\n", "你是一名专业的数据智能分析处理专家"),
    /**
     * 法条正文修正模板
     */
    LAWREVISE("lawRevision", "不改变原文内容的条件下，修正下述法条正文的格式并纠正可能存在的错误，如果正文含有章、条则按照分章、条以换行符\\n分段但不要有多余空行和*字符，检查标点符号语法等正确后返回纯文本（不带markdown格式、不加粗、没有多于换行）:\n", "你是一名专业的数据智能分析处理专家");

    private final String name;
    private final String template;
    private final String prompt;

    PromptTemplate(String name, String template, String prompt) {
        this.name = name;
        this.template = template;
        this.prompt = prompt;
    }
}
